; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	satellite5 - satellite
	instrument8 - instrument
	instrument9 - instrument
	instrument10 - instrument
	satellite6 - satellite
	instrument11 - instrument
	satellite7 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite8 - satellite
	instrument15 - instrument
	instrument16 - instrument
	satellite9 - satellite
	instrument17 - instrument
	instrument18 - instrument
	instrument19 - instrument
	satellite10 - satellite
	instrument20 - instrument
	instrument21 - instrument
	spectrograph1 - mode
	image0 - mode
	spectrograph2 - mode
	GroundStation1 - direction
	Star2 - direction
	Star4 - direction
	Star0 - direction
	GroundStation3 - direction
	Star5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image0)
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(supports instrument1 image0)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph2)
	(supports instrument2 image0)
	(supports instrument2 spectrograph1)
	(calibration_target instrument2 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument3 image0)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star2)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star0)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation1)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph2)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation3)
	(on_board instrument7 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon6)
	(supports instrument8 image0)
	(calibration_target instrument8 Star4)
	(supports instrument9 spectrograph2)
	(supports instrument9 image0)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 spectrograph2)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation1)
	(on_board instrument8 satellite5)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star5)
	(supports instrument11 spectrograph1)
	(supports instrument11 image0)
	(calibration_target instrument11 Star0)
	(on_board instrument11 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon6)
	(supports instrument12 spectrograph2)
	(calibration_target instrument12 Star0)
	(supports instrument13 spectrograph2)
	(calibration_target instrument13 Star0)
	(supports instrument14 spectrograph1)
	(supports instrument14 spectrograph2)
	(calibration_target instrument14 Star2)
	(on_board instrument12 satellite7)
	(on_board instrument13 satellite7)
	(on_board instrument14 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star4)
	(supports instrument15 spectrograph2)
	(supports instrument15 spectrograph1)
	(supports instrument15 image0)
	(calibration_target instrument15 GroundStation1)
	(supports instrument16 spectrograph2)
	(calibration_target instrument16 Star2)
	(on_board instrument15 satellite8)
	(on_board instrument16 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Star4)
	(supports instrument17 spectrograph2)
	(calibration_target instrument17 Star4)
	(supports instrument18 spectrograph1)
	(calibration_target instrument18 GroundStation3)
	(supports instrument19 spectrograph2)
	(calibration_target instrument19 Star4)
	(on_board instrument17 satellite9)
	(on_board instrument18 satellite9)
	(on_board instrument19 satellite9)
	(power_avail satellite9)
	(pointing satellite9 GroundStation1)
	(supports instrument20 image0)
	(supports instrument20 spectrograph1)
	(supports instrument20 spectrograph2)
	(calibration_target instrument20 Star0)
	(supports instrument21 image0)
	(supports instrument21 spectrograph2)
	(calibration_target instrument21 GroundStation3)
	(on_board instrument20 satellite10)
	(on_board instrument21 satellite10)
	(power_avail satellite10)
	(pointing satellite10 Star4)
)
(:goal (and
	(pointing satellite0 Star2)
	(pointing satellite2 Star0)
	(pointing satellite6 GroundStation3)
	(pointing satellite10 Phenomenon6)
	(have_image Star5 spectrograph1)
	(have_image Phenomenon6 spectrograph2)
	(have_image Planet7 image0)
	(have_image Planet8 image0)
	(have_image Phenomenon9 spectrograph1)
))

)

; plan
1. (turn_to satellite10 star0 star4)
   deleted: (pointing satellite10 star4)
   added: (pointing satellite10 star0)
   goals met: 0 of 9
2. (switch_on instrument20 satellite10)
   deleted: (power_avail satellite10)
   added: (power_on instrument20)
   goals met: 0 of 9
3. (calibrate satellite10 instrument20 star0)
   added: (calibrated instrument20)
   goals met: 0 of 9
4. (turn_to satellite10 planet8 star0)
   deleted: (pointing satellite10 star0)
   added: (pointing satellite10 planet8)
   goals met: 0 of 9
5. (take_image satellite10 planet8 instrument20 image0)
   added: (have_image planet8 image0)
   goals met: 1 of 9
6. (turn_to satellite10 planet7 planet8)
   deleted: (pointing satellite10 planet8)
   added: (pointing satellite10 planet7)
   goals met: 1 of 9
7. (take_image satellite10 planet7 instrument20 image0)
   added: (have_image planet7 image0)
   goals met: 2 of 9
8. (turn_to satellite10 phenomenon9 planet7)
   deleted: (pointing satellite10 planet7)
   added: (pointing satellite10 phenomenon9)
   goals met: 2 of 9
9. (turn_to satellite0 star2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 star2)
   goals met: 3 of 9
10. (take_image satellite10 phenomenon9 instrument20 spectrograph1)
   added: (have_image phenomenon9 spectrograph1)
   goals met: 4 of 9
11. (turn_to satellite10 star5 phenomenon9)
   deleted: (pointing satellite10 phenomenon9)
   added: (pointing satellite10 star5)
   goals met: 4 of 9
12. (take_image satellite10 star5 instrument20 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 5 of 9
13. (turn_to satellite10 phenomenon6 star5)
   deleted: (pointing satellite10 star5)
   added: (pointing satellite10 phenomenon6)
   goals met: 6 of 9
14. (take_image satellite10 phenomenon6 instrument20 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 7 of 9
15. (turn_to satellite2 star0 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 star0)
   goals met: 8 of 9
16. (turn_to satellite6 groundstation3 phenomenon6)
   deleted: (pointing satellite6 phenomenon6)
   added: (pointing satellite6 groundstation3)
   goals met: 9 of 9
